## Production: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 10 to add, 12 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                    |
|--------|----------------------------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.file_upload_cleanup_trigger`                    |
|        | `aws_cloudwatch_event_target.file_upload_cleanup_trigger`                  |
|        | `aws_cloudwatch_log_group.file_upload`                                     |
|        | `aws_cloudwatch_log_group.file_upload_cleanup`                             |
|        | `aws_iam_policy.lambda_xray`                                               |
|        | `aws_iam_role_policy_attachment.lambda_xray`                               |
|        | `aws_lambda_event_source_mapping.file_upload`                              |
|        | `aws_lambda_function.file_upload`                                          |
|        | `aws_lambda_function.file_upload_cleanup`                                  |
|        | `aws_lambda_permission.allow_cloudwatch_to_run_file_upload_cleanup_lambda` |
| update | `aws_iam_policy.lambda_dynamodb`                                           |
|        | `aws_lambda_function.api_end_to_end_test`                                  |
|        | `aws_lambda_function.audit_logs`                                           |
|        | `aws_lambda_function.audit_logs_archiver`                                  |
|        | `aws_lambda_function.form_archiver`                                        |
|        | `aws_lambda_function.nagware`                                              |
|        | `aws_lambda_function.prisma_migration`                                     |
|        | `aws_lambda_function.reliability`                                          |
|        | `aws_lambda_function.reliability_dlq_consumer`                             |
|        | `aws_lambda_function.response_archiver`                                    |
|        | `aws_lambda_function.submission`                                           |
|        | `aws_lambda_function.vault_integrity`                                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.file_upload_cleanup_trigger will be created
  + resource "aws_cloudwatch_event_rule" "file_upload_cleanup_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every 2 hours"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "file-upload-cleanup-trigger"
      + name_prefix         = (known after apply)
      + region              = "ca-central-1"
      + schedule_expression = "rate(2 hours)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.file_upload_cleanup_trigger will be created
  + resource "aws_cloudwatch_event_target" "file_upload_cleanup_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ca-central-1"
      + rule           = "file-upload-cleanup-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.file_upload will be created
  + resource "aws_cloudwatch_log_group" "file_upload" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/file-upload-processor"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.file_upload_cleanup will be created
  + resource "aws_cloudwatch_log_group" "file_upload_cleanup" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/file-upload-cleanup"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_dynamodb will be updated in-place
  ~ resource "aws_iam_policy" "lambda_dynamodb" {
        id               = "arn:aws:iam::957818836222:policy/lambda_dynamobdb"
        name             = "lambda_dynamobdb"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault",
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/ReliabilityQueue/index/*",
                            "arn:aws:dynamodb:ca-central-1:957818836222:table/ReliabilityQueue",
                            # (4 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_xray will be created
  + resource "aws_iam_policy" "lambda_xray" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for allowing X-Ray tracing"
      + id               = (known after apply)
      + name             = "lambda_xray"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                          + "ssm:GetParameters",
                          + "logs:PutRetentionPolicy",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.lambda_xray will be created
  + resource "aws_iam_role_policy_attachment" "lambda_xray" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_lambda_event_source_mapping.file_upload will be created
  + resource "aws_lambda_event_source_mapping" "file_upload" {
      + arn                                = (known after apply)
      + batch_size                         = 10
      + enabled                            = true
      + event_source_arn                   = "arn:aws:sqs:ca-central-1:957818836222:file_upload_queue"
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 30
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + region                             = "ca-central-1"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + tags_all                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + uuid                               = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # aws_lambda_function.api_end_to_end_test will be updated in-place
  ~ resource "aws_lambda_function" "api_end_to_end_test" {
        id                             = "api-end-to-end-test"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "audit-logs"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs_archiver will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs_archiver" {
        id                             = "audit-logs-archiver"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.file_upload will be created
  + resource "aws_lambda_function" "file_upload" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "file-upload-processor"
      + id                             = (known after apply)
      + image_uri                      = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/file-upload-processor-lambda:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ca-central-1"
      + reserved_concurrent_executions = 1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT" = "production"
              + "REGION"      = "ca-central-1"
              + "SQS_URL"     = "https://sqs.ca-central-1.amazonaws.com/957818836222/reliability_queue"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/file-upload-processor"
        }

      + tracing_config {
          + mode = "Active"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0450b09572a6e347e",
            ]
          + subnet_ids                  = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.file_upload_cleanup will be created
  + resource "aws_lambda_function" "file_upload_cleanup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "file-upload-cleanup"
      + id                             = (known after apply)
      + image_uri                      = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/file-upload-cleanup-lambda:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ca-central-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"                             = "production"
              + "REGION"                                  = "ca-central-1"
              + "S3_RELIABILITY_FILE_STORAGE_BUCKET_NAME" = "forms-production-reliability-file-storage"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/file-upload-cleanup"
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "form-archiver"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "nagware"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.prisma_migration will be updated in-place
  ~ resource "aws_lambda_function" "prisma_migration" {
        id                             = "prisma-migration"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "reliability"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "reliability-dlq-consumer"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "response-archiver"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "ENVIRONMENT"                             = "production"
              + "S3_RELIABILITY_FILE_STORAGE_BUCKET_NAME" = "forms-production-reliability-file-storage"
                # (2 unchanged elements hidden)
            }
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "vault-integrity"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_file_upload_cleanup_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_file_upload_cleanup_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "file-upload-cleanup"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ca-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

Plan: 10 to add, 12 to change, 0 to destroy.

Changes to Outputs:
  + lambda_file_upload_cleanup_log_group_name      = "/aws/lambda/file-upload-cleanup"
  + lambda_file_upload_processor_log_group_name    = "/aws/lambda/file-upload-processor"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.file_upload_cleanup_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_end_to_end_test"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.file_upload"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.file_upload_cleanup"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.prisma_migration_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing...
```

</details>
